# -*- coding: utf-8 -*-
"""
Задание 6.2a

Сделать копию скрипта задания 6.2.

Добавить проверку введенного IP-адреса.
Адрес считается корректно заданным, если он:
   - состоит из 4 чисел (а не букв или других символов)
   - числа разделенны точкой
   - каждое число в диапазоне от 0 до 255

Если адрес задан неправильно, выводить сообщение: 'Неправильный IP-адрес'

Сообщение "Неправильный IP-адрес" должно выводиться только один раз,
даже если несколько пунктов выше не выполнены.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""


ip_address = input("Введите IP адрес (прим. 10.0.1.1): ")
ip = ip_address.split(".")
check = True

if len(ip) != 4:
   check = False
else:
   for oct in ip:
      if not (oct.isdigit and 0 <= int(oct) <= 255):
         check = False
         break

if check != True:
   print("Неправильный IP-адрес")
else:
    if 0 < int(ip[0]) < 224:
       print("unicast")
    elif 223 < int(ip[0]) < 240:
       print("multicast")
    elif ip_address == "255.255.255.255":
       print("local broadcast")
    elif ip_address == "0.0.0.0":
       print("unassigned")
    else:
       print("unused")
